# RodCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationRodInfo..::..RodCount Property
FabricationRodInfo Class See Also
---
Gets the number of rods.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int RodCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RodCount As Integer
	Get
```

Visual C++
---
```text
public:
property int RodCount {
	int get ();
}
```

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace